[Reference](https://towardsdatascience.com/how-to-extract-data-from-existing-series-and-dataframe-in-pandas-8d6882814ab7)

In [1]:
import pandas as pd

s0 = pd.Series([1, 2, 3])
s1 = pd.Series([10, 20, 30])
s2 = pd.Series([100, 200, 300])
df = pd.DataFrame({'col 0': s0, 'col 1': s1, 'col 2': s2})
df.index = ['row 0', 'row 1', 'row 2']

df

       col 0  col 1  col 2
row 0      1     10    100
row 1      2     20    200
row 2      3     30    300

In [2]:
# Use a dictionary object
s0.map({1: 1, 2: 4, 3: 9})

# Use a lambda function
s0.map(lambda x: x*x)

# Use a regular function
def square(x):
    return x*x
s0.map(square)

0    1
1    4
2    9
dtype: int64

In [3]:
df['col 3'] = df['col 0'].map(lambda x: x*x)
df.loc['row 3'] = df.loc['row 2'].map(lambda x: x+1)
df

       col 0  col 1  col 2  col 3
row 0      1     10    100      1
row 1      2     20    200      4
row 2      3     30    300      9
row 3      4     31    301     10

In [4]:
# Use a lambda function
df['col 4'] = df.apply(
    lambda x: x['col 0'] * x['col 1'],
    axis=1
)

# Use a regular function
def create_col(x, n):
    return x['col 0'] * n
df['col 5'] = df.apply(create_col, axis=1, args=(5,))

df

       col 0  col 1  col 2  col 3  col 4  col 5
row 0      1     10    100      1     10      5
row 1      2     20    200      4     40     10
row 2      3     30    300      9     90     15
row 3      4     31    301     10    124     20

In [5]:
s0.apply(lambda x: pd.Series([x, 2*x, 3*x]))

   0  1  2
0  1  2  3
1  2  4  6
2  3  6  9

In [6]:
# Create two columns using a column of DataFrame
df[['col 6', 'col 7']] = df['col 5'].apply(lambda x: pd.Series([x*2, x*3]))
df

       col 0  col 1  col 2  col 3  col 4  col 5  col 6  col 7
row 0      1     10    100      1     10      5     10     15
row 1      2     20    200      4     40     10     20     30
row 2      3     30    300      9     90     15     30     45
row 3      4     31    301     10    124     20     40     60

In [7]:
df[['col 8', 'col 9']] = df.apply(
     lambda x: [x['col 6'] + 1, x['col 7'] + 2],
     axis=1,
     result_type='expand'
 )
df

       col 0  col 1  col 2  col 3  col 4  col 5  col 6  col 7  col 8  col 9
row 0      1     10    100      1     10      5     10     15     11     17
row 1      2     20    200      4     40     10     20     30     21     32
row 2      3     30    300      9     90     15     30     45     31     47
row 3      4     31    301     10    124     20     40     60     41     62